Repository: RockxyApp/Rockxy
Catalog: Rockxy/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Select Plugin Folder
zh_hans: 选择插件文件夹

source: Select Previous Tab
zh_hans: 选择上一个标签页

source: Select Request, Response, or both.
zh_hans: 选择请求、响应或两者。

source: Select text to preview.
zh_hans: 选择文本以预览。

source: Select the original request and run the investigation again.
zh_hans: 选择原始请求并再次运行调查。

source: Select the upstream proxy protocol.
zh_hans: 选择上游代理协议。

source: Select traffic to add context
zh_hans: 选择流量以添加上下文

source: Select two requests and choose "Compare Selected" to start a basic local compare.
zh_hans: 选择两个请求并选取 “比较所选项”，即可开始基本本地比较。

source: Selected
zh_hans: 已选择

source: Selected and Related Traffic
zh_hans: 所选和相关流量

source: Selected Event
zh_hans: 所选事件

source: Selected network interface
zh_hans: 所选网络接口

source: Selected request
zh_hans: 所选请求

source: Selected Request
zh_hans: 所选请求

source: Selected request + %lld related requests
zh_hans: 选定的请求 + %lld 个相关请求

source: Selected request was %@ faster
zh_hans: 所选请求快了 %@

source: Selected request was %@ slower
zh_hans: 所选请求慢了 %@

source: Selected Requests
zh_hans: 所选请求

source: Selected traffic inspected
zh_hans: 已检查所选流量

source: Selected traffic only
zh_hans: 仅所选流量

source: Selected Traffic Only
zh_hans: 仅所选流量

source: Selected Traffic Only (%@)
zh_hans: 仅所选流量（%@）

source: Selected: HTTP %@
zh_hans: 已选择：HTTP %@

source: Selection
zh_hans: 选择

source: Selection could not be decoded as Base64.
zh_hans: 无法将所选内容解码为 Base64。

source: Selection does not contain key-value pairs.
zh_hans: 所选内容不包含键值对。

source: Selection is not valid JSON.
zh_hans: 所选内容不是有效的 JSON。

source: Selection Summary
zh_hans: 选择摘要

source: Selection Too Large
zh_hans: 所选内容过大

source: Selections over 256 KB are not previewed.
zh_hans: 超过 256 KB 的选定内容不会被预览。

source: Send
zh_hans: 发送

source: Send a request to see the response here.
zh_hans: 发送请求后，可在此查看响应。

source: Send a single HTTPS request to confirm
zh_hans: 发送单个 HTTPS 请求以确认

source: Send an HTTP 403 response to the client.
zh_hans: 向客户端发送 HTTP 403 响应。

source: Send anonymous compatibility profile
zh_hans: 发送匿名兼容性配置

source: Send matching system traffic directly instead of through Rockxy.
zh_hans: 让匹配的系统流量直接发送，而不经过 Rockxy。

source: Send message
zh_hans: 发送消息

source: Send Message
zh_hans: 发送消息

source: Send one known HTTPS request from the app
zh_hans: 从 App 发送一个已知的 HTTPS 请求

source: Send Redacted Data
zh_hans: 发送已脱敏数据

source: Sending...
zh_hans: 正在发送...

source: Sensitive fields redacted
zh_hans: 敏感字段已脱敏

source: Sensitive headers, query values, and body fields are redacted before Review Data.
zh_hans: 敏感标头、查询值和正文字段会在“审查数据”之前被脱敏。

source: Sent
zh_hans: 已发送

source: Separate host patterns with commas or new lines.
zh_hans: 使用逗号或换行符分隔主机模式。

source: Separate host patterns with commas or new lines. Wildcards * and ? are supported; duplicates are removed when applied.
zh_hans: 请使用逗号或换行分隔主机模式。支持通配符 * 和 ?；应用时会移除重复项。

source: Serve a local file or directory for matching requests.
zh_hans: 为匹配请求提供本地文件或目录。

source: server
zh_hans: 服务器

source: Server Certificate Host
zh_hans: 服务器证书主机

source: Server Certificates
zh_hans: 服务器证书

source: Server returned HTTP %lld
zh_hans: 服务器返回 HTTP %lld

source: Server returned HTTP %lld for the selected request.
zh_hans: 服务器为所选请求返回 HTTP %lld。

source: Server returned HTTP 429 after repeated requests.
zh_hans: 在多次请求后，服务器返回了 HTTP 429。

source: Server returned HTTP 429 for the selected request.
zh_hans: 服务器对选定的请求返回了 HTTP 429。

source: Server Wait
zh_hans: 服务器等待

source: Server wait dominates
zh_hans: 服务器等待占主导

source: Service / method
zh_hans: 服务/方法

source: Session
zh_hans: 会话

source: Session Finished
zh_hans: 会话已结束

source: Session Import Failed
zh_hans: 会话导入失败

source: Session Started
zh_hans: 会话已开始

source: Session Too Large
zh_hans: 会话过大

source: Set
zh_hans: 设置

source: Set a manual HTTP proxy on the active Wi-Fi
zh_hans: 在当前 Wi-Fi 上设置手动 HTTP 代理

source: Set a manual HTTP proxy on the active Wi-Fi, install the Rockxy certificate profile in Safari, enable Full Trust, then cold-launch the React Native app.
zh_hans: 在当前 Wi-Fi 上设置手动 HTTP 代理，在 Safari 中安装 Rockxy 证书描述文件，启用完全信任，然后冷启动 React Native 应用。

source: Set a manual HTTP proxy on the active Wi-Fi, scan the temporary Rockxy certificate link, install the profile, and enable full trust under Certificate Trust Settings.
zh_hans: 在当前 Wi-Fi 上设置手动 HTTP 代理，扫描临时 Rockxy 证书链接，安装描述文件，然后在“证书信任设置”中启用完全信任。

source: Set a manual HTTP proxy on the device
zh_hans: 在设备上设置手动 HTTP 代理

source: Set a manual proxy on the active Wi-Fi
zh_hans: 在当前 Wi-Fi 上设置手动代理

source: Set a manual proxy on the active Wi-Fi, share or install the Rockxy PEM as a user CA, and rely on a debug build whose network-security-config trusts user CAs.
zh_hans: 在当前 Wi-Fi 上设置手动代理，将 Rockxy PEM 共享或安装为用户 CA，并使用其 network-security-config 信任用户 CA 的调试构建。

source: Set the emulator proxy to 10.0.2.2 plus Rockxy's active port, install the Root CA in the emulator, and use the Android XML snippet for debug builds.
zh_hans: 将模拟器代理设置为 10.0.2.2 和 Rockxy 的当前端口，在模拟器中安装根 CA，并为调试构建使用 Android XML 代码片段。

source: Set the macOS system proxy to Rockxy so simulator apps inherit it; simctl does not have a first-party proxy switch today.
zh_hans: 将 macOS 系统代理设置为 Rockxy，使模拟器 App 继承该设置；simctl 目前没有第一方代理开关。

source: Set the Wi-Fi proxy to the Device Proxy host shown by Rockxy, install the Root CA as a user CA, and use a debug build whose network-security-config trusts user CAs.
zh_hans: 将 Wi-Fi 代理设为 Rockxy 显示的设备代理主机，将根 CA 安装为用户 CA，并使用其 network-security-config 信任用户 CA 的调试构建。

source: Set Up Ollama…
zh_hans: 设置 Ollama…

source: Set up the underlying device or emulator first
zh_hans: 请先设置底层设备或模拟器

source: Set Up…
zh_hans: 设置…

source: Set When using this certificate to Always Trust, then close the window and approve the change.
zh_hans: 将“使用此证书时”设置为“始终信任”，然后关闭窗口并批准更改。

source: Set, add, or remove HTTP headers on matching requests and responses. Each rule can have multiple header operations.
zh_hans: 设置、添加或移除匹配请求和响应的 HTTP 标头。每条规则可以包含多个标头操作。

source: Settings
zh_hans: 设置

source: Settings categories
zh_hans: 设置类别

source: Settings…
zh_hans: 设置…

source: Setup
zh_hans: 设置

source: Setup command copied.
zh_hans: 设置命令已复制。

source: Setup command copied. Paste it into your terminal.
zh_hans: 设置命令已复制。请将其粘贴到终端中。

source: Setup guide available
zh_hans: 设置指南可用

source: Setup Mode
zh_hans: 设置模式

source: Setup script is ready.
zh_hans: 设置脚本已就绪。

source: SHA-256 (all captured bytes)
zh_hans: SHA-256（所有已捕获字节）

source: SHA-256 (captured bytes)
zh_hans: SHA-256（已捕获字节）

source: Share CA for Device
zh_hans: 为设备共享 CA

source: Share Certificate
zh_hans: 共享证书

source: Share Certificate…
zh_hans: 共享证书…

source: Share the public Rockxy Root CA from this Mac as a temporary local QR code and link, then finish the platform trust steps on the device or simulator.
zh_hans: 从这台 Mac 以临时本地 QR 码和链接的形式共享公开的 Rockxy 根 CA，然后在设备或模拟器上完成平台信任步骤。

source: Shared state cleared.
zh_hans: 共享状态已清除。

source: Shorten this message before sending it to the Assistant.
zh_hans: 在将此消息发送给助手之前，请将其缩短。

source: Show %@ column
zh_hans: 显示 %@ 列

# Show %@ traffic. %@
source: Show %1$@ traffic. %2$@
zh_hans: 显示 %1$@ 流量。%2$@

source: Show a request or response header value as a column. Changes appear in the traffic table right away.
zh_hans: 将请求或响应标头值显示为一列。更改会立即出现在流量表中。

source: Show alert when quitting Rockxy
zh_hans: 退出 Rockxy 时显示提醒

source: Show All Traffic
zh_hans: 显示所有流量

source: Show Bottom Inspector
zh_hans: 显示底部检查器

source: Show compound filters
zh_hans: 显示复合筛选器

source: Show Context Dock
zh_hans: 显示上下文面板

source: Show in Finder
zh_hans: 在“访达”中显示

source: Show in Finder…
zh_hans: 在 Finder 中显示…

source: Show In Table
zh_hans: 在表格中显示

source: Show Invisibles
zh_hans: 显示不可见字符

source: Show me how to verify the leading cause in Rockxy.
zh_hans: 告诉我如何在 Rockxy 中验证首要原因。

source: Show Minimap
zh_hans: 显示小地图

source: Show Models Folder
zh_hans: 显示模型文件夹

source: Show on startup
zh_hans: 启动时显示

source: Show or hide the bottom inspector panel
zh_hans: 显示或隐藏底部检查器面板

source: Show or hide the Context Dock
zh_hans: 显示或隐藏上下文停靠栏

source: Show or hide the Source List
zh_hans: 显示或隐藏来源列表

source: Show Setup Script in Finder
zh_hans: 在 Finder 中显示设置脚本

source: Show system proxy override details. Toggle by: ⌥⌘O
zh_hans: 显示系统代理覆盖详情。切换方式：⌥⌘O

source: Show this request header's value as a column in the traffic table.
zh_hans: 在流量表格中将此请求标头的值显示为一列。

source: Show this response header's value as a column in the traffic table.
zh_hans: 在流量表中将此响应标头的值显示为一列。

source: Show Token
zh_hans: 显示令牌

source: Show when all match
zh_hans: 全部匹配时显示

source: Show: ⌘F
zh_hans: 显示：⌘F

# Showing %lld of %lld. Search to find more.
source: Showing %1$lld of %2$lld. Search to find more.
zh_hans: 正在显示 %1$lld 个，共 %2$lld 个。搜索以查找更多。

source: Shown
zh_hans: 已显示

source: Shows the evidence and recommended next step
zh_hans: 显示证据和建议的下一步操作

source: Side A — paste or type text
zh_hans: A 侧 — 粘贴或输入文本

source: Side B — paste or type text
zh_hans: B 侧 — 粘贴或输入文本

source: Side by Side
zh_hans: 并排

source: Signal: %@
zh_hans: 信号：%@

source: Signals
zh_hans: 信号

source: Signature
zh_hans: 签名

source: Signature segment is empty.
zh_hans: 签名段为空。

source: Signed updates are enabled for this build.
zh_hans: 此构建已启用签名更新。

source: Signing Mismatch
zh_hans: 签名不匹配

source: Simulate latency and bandwidth limits for matching HTTP and HTTPS traffic.
zh_hans: 为匹配的 HTTP 和 HTTPS 流量模拟延迟和带宽限制。

source: Simulation
zh_hans: 模拟

source: Single Message
zh_hans: 单条消息

source: Size
zh_hans: 大小

source: Size:
zh_hans: 大小：

source: Skip This Version
zh_hans: 跳过此版本

source: Slot %lld
zh_hans: 槽位 %lld

source: Slow
zh_hans: 慢速

source: Slow request
zh_hans: 慢速请求

source: Slower than this host's recent requests
zh_hans: 比该主机最近的请求更慢

source: Slowest Phase
zh_hans: 最慢阶段

source: Small multilingual model with a strong quality-to-size balance
zh_hans: 兼顾质量与体积的小型多语言模型

source: Small reasoning model for lower-memory Macs
zh_hans: 适用于低内存 Mac 的小型推理模型

source: Snippet
zh_hans: 代码片段

source: Snippet copied.
zh_hans: 已复制代码片段。

source: Snippets
zh_hans: 代码片段

source: SOCKS Proxy
zh_hans: SOCKS 代理

source: SOCKS Proxy Settings
zh_hans: SOCKS 代理设置

source: SOCKS5 now uses the shared External Proxy workflow.
zh_hans: SOCKS5 现在使用共享的外部代理工作流。

source: SOCKS5 Proxy
zh_hans: SOCKS5 代理

source: SOCKS5 proxy connection succeeded.
zh_hans: SOCKS5 代理连接成功。

source: SOCKS5 proxy could not reach the host.
zh_hans: SOCKS5 代理无法访问主机。

source: SOCKS5 proxy could not reach the network.
zh_hans: SOCKS5 代理无法连接到网络。

source: SOCKS5 proxy does not support CONNECT.
zh_hans: SOCKS5 代理不支持 CONNECT。

source: SOCKS5 proxy does not support domain-name targets.
zh_hans: SOCKS5 代理不支持域名目标。

source: SOCKS5 proxy rejected the connection by rule.
zh_hans: SOCKS5 代理按规则拒绝了连接。

source: SOCKS5 proxy reported a general failure.
zh_hans: SOCKS5 代理报告一般故障。

source: SOCKS5 proxy selected unsupported authentication method %u.
zh_hans: SOCKS5 代理选择了不受支持的认证方法 %u。

source: SOCKS5 target connection TTL expired.
zh_hans: SOCKS5 目标连接 TTL 已过期。

source: SOCKS5 target connection was refused.
zh_hans: SOCKS5 目标连接被拒绝。

source: SOCKS5 target host is too long.
zh_hans: SOCKS5 目标主机过长。

source: SOCKS5 unavailable
zh_hans: SOCKS5 不可用

source: SOCKS5 upstream proxy is unavailable in this build.
zh_hans: 此构建无法使用 SOCKS5 上游代理。

source: SOCKS5 upstream proxying isn't available in this build — only HTTP/HTTPS proxies or a PAC URL can be applied. Open External Proxy Settings to configure one of those.
zh_hans: 此版本不支持 SOCKS5 上游代理 — 只能应用 HTTP/HTTPS 代理或 PAC URL。请打开外部代理设置来配置其中之一。

source: Software Update
zh_hans: 软件更新

source: Software update couldn’t be completed
zh_hans: 无法完成软件更新

source: Software updates are not configured for this build.
zh_hans: 此构建未配置软件更新。

source: Software updates are unavailable in this local build.
zh_hans: 在此本地版本中无法使用软件更新。

source: Some HTTP clients bypass the system proxy
zh_hans: 某些 HTTP 客户端会绕过系统代理

source: Some shortcuts depend on focus — click the panel first.
zh_hans: 某些快捷键取决于焦点 — 请先点击面板。

source: Sort by Alphabet
zh_hans: 按字母排序

source: Sort JSON Keys
zh_hans: 对 JSON 键排序

source: Source
zh_hans: 来源

source: Source Client
zh_hans: 来源客户端

source: Source List
zh_hans: 来源列表

source: Source List Divider
zh_hans: 来源列表分隔线

source: Source Port
zh_hans: 来源端口

source: Source type
zh_hans: 来源类型

source: Source Type
zh_hans: 来源类型

source: Specific host
zh_hans: 特定主机

source: SSE cadence is shown from captured events. Token boundaries stay unavailable unless the provider exposes them.
zh_hans: SSE 节奏根据已捕获的事件显示。除非提供商公开 token 边界，否则 token 边界不可用。

source: SSL failures usually trace to network-security-config
zh_hans: SSL 失败通常源于 network-security-config

source: SSL Proxying
zh_hans: SSL 代理

source: SSL Proxying is already enabled for %@. Make the request again to inspect it.
zh_hans: 已为 %@ 启用 SSL 代理。请再次发送请求以检查它。

source: Stale simulator state can hide certificate trust
zh_hans: 过时的模拟器状态可能会隐藏证书信任

source: Start
zh_hans: 开始

source: Start a Babylon trace on a paired client to see runtime events here.
zh_hans: 在已配对的客户端上启动 Babylon 跟踪，以在此处查看运行时事件。

source: Start a local HTTP server for Model Context Protocol (MCP) communication with compatible tools.
zh_hans: 启动本地 HTTP 服务器，以便通过模型上下文协议 (MCP) 与兼容工具通信。

source: Start an investigation
zh_hans: 开始一项调查

source: Start Authorization
zh_hans: 开始授权

source: Start Capture
zh_hans: 开始捕获

source: Start capture to record requests, then select one to inspect its context.
zh_hans: 开始捕获以记录请求，然后选择一个以检查其上下文。

source: Start capturing network traffic as soon as the app launches.
zh_hans: App 启动后立即开始捕获网络流量。

source: Start Check
zh_hans: 开始检查

source: Start Ollama on this Mac, then check again. (%@)
zh_hans: 在这台 Mac 上启动 Ollama，然后再次检查。（%@）

source: Start or Stop Proxy
zh_hans: 启动或停止代理

source: Start proxy
zh_hans: 启动代理

source: Start Proxy
zh_hans: 启动代理

source: Start Rockxy before pointing traffic at the proxy.
zh_hans: 将流量指向代理前，请先启动 Rockxy。

source: Start Rockxy before you point %@ traffic at the local proxy.
zh_hans: 将 %@ 流量指向本地代理前，请先启动 Rockxy。

source: Start the proxy before changing recording
zh_hans: 更改记录状态前请先启动代理

source: Start the proxy before changing recording. ⌥⌘R
zh_hans: 更改记录状态前，请先启动代理。⌥⌘R

source: Start the proxy to begin capturing network traffic.
zh_hans: 启动代理以开始捕获网络流量。

source: Start the proxy to route system traffic through Rockxy.
zh_hans: 启动代理以通过 Rockxy 路由系统流量。

source: Start the Rockxy proxy before opening a prepared terminal.
zh_hans: 打开预配置终端前，请先启动 Rockxy 代理。

source: Start the Rockxy proxy before validating captured traffic.
zh_hans: 验证捕获的流量前，请先启动 Rockxy 代理。

source: Start Using Rockxy
zh_hans: 开始使用 Rockxy

source: Start your server or scripts there so Rockxy can capture the traffic.
zh_hans: 在此处启动服务器或脚本，以便 Rockxy 捕获流量。

source: Started
zh_hans: 已开始

source: Starting
zh_hans: 正在启动

source: Starting Capture
zh_hans: 正在开始捕获

source: Starting Ollama and checking the local service…
zh_hans: 正在启动 Ollama 并检查本地服务…

source: Starting Proxy
zh_hans: 正在启动代理

source: Starting…
zh_hans: 正在启动…

source: Starts With
zh_hans: 开头为

source: State
zh_hans: 状态

source: State read with no expected write
zh_hans: 读取状态，不预期写入

source: Status
zh_hans: 状态

source: Status code
zh_hans: 状态码

source: Status Icon
zh_hans: 状态图标

source: Status Line
zh_hans: 状态行

source: Status, timing, payload, and rule checks look normal.
zh_hans: 状态、时序、有效载荷和规则检查看起来正常。

source: Step
zh_hans: 步骤

source: Step %lld
zh_hans: 第 %lld 步

source: Step Finished
zh_hans: 步骤已完成

source: Step Started
zh_hans: 步骤已开始

source: Stop
zh_hans: 停止

source: Stop Capture
zh_hans: 停止捕获

source: Stop Metro, change proxy or certificate trust, run adb reverse tcp:8081 tcp:8081 for Android when needed, then restart Metro and cold-launch the app.
zh_hans: 停止 Metro，更改代理或证书信任，需要时为 Android 运行 adb reverse tcp:8081 tcp:8081，然后重新启动 Metro 并冷启动 App。

source: Stop proxy
zh_hans: 停止代理

source: Stop Proxy
zh_hans: 停止代理

source: Stop Sharing
zh_hans: 停止共享

source: Stop this transaction with a 503 Service Unavailable response
zh_hans: 以 503 Service Unavailable 响应停止此事务

source: Stopped
zh_hans: 已停止

source: Store .proto source files on this Mac.
zh_hans: 将 .proto 源文件存储在这台 Mac 上。

source: Stream
zh_hans: 流

source: Streaming
zh_hans: 流式传输

source: Streaming Tool
zh_hans: 流式工具

source: Strip Server Header
zh_hans: 移除 Server 标头

source: Subject
zh_hans: 主题

source: Subscription
zh_hans: 订阅

source: Success
zh_hans: 成功

source: Successful baseline unavailable
zh_hans: 成功基线不可用

source: Suggested Check
zh_hans: 建议的检查

source: Summarize reproducible evidence without exposing captured secrets.
zh_hans: 在不暴露已捕获机密的情况下总结可复现的证据。

source: Summary
zh_hans: 摘要

source: Support wildcard * and ?.
zh_hans: 支持通配符 * 和 ?。

source: Supports * and ?.
zh_hans: 支持 * 和 ?。

source: Supports Terminal, iTerm2, Ghostty, Hyper, and Bash/Zsh/Fish shells.
zh_hans: 支持“终端”、iTerm2、Ghostty、Hyper 以及 Bash/Zsh/Fish shell。

source: Swap Sides
zh_hans: 交换两侧

source: Swap the left and right sides
zh_hans: 交换左右两侧

source: Switch Layout
zh_hans: 切换布局

source: Switch Off
zh_hans: 关闭

source: Switch to side-by-side layout
zh_hans: 切换到并排布局

source: Switch to stacked layout
zh_hans: 切换到堆叠布局

source: Switch to the snippet that matches the runtime, library, or tool you are using.
zh_hans: 切换到与你所用的运行时、库或工具匹配的代码片段。

source: System
zh_hans: 系统

source: System certificate installation requires a writable image
zh_hans: 系统证书安装需要可写映像

source: System Default
zh_hans: 系统默认

source: System Default follows your Mac. Choosing another language changes Rockxy immediately.
zh_hans: 系统默认会跟随 Mac 的语言。选择其他语言会立即更改 Rockxy。

source: System Proxy
zh_hans: 系统代理

# System Proxy is Overridden by Rockxy (IP=%@ Port=%lld) (Toggle by: ⌥⌘O)
source: System Proxy is Overridden by Rockxy (IP=%1$@ Port=%2$lld) (Toggle by: ⌥⌘O)
zh_hans: 系统代理已被 Rockxy 覆盖（IP=%1$@ 端口=%2$lld）（切换快捷键：⌥⌘O）

source: System routing
zh_hans: 系统路由

source: System Routing
zh_hans: 系统路由

source: System routing is unavailable while the proxy server is stopped.
zh_hans: 代理服务器停止时，系统路由不可用。

source: System Validation:
zh_hans: 系统验证：

source: System-proxy clients connect directly. Manually configured clients that still reach Rockxy are tunneled without decryption.
zh_hans: 使用系统代理的客户端会直接连接。仍能访问 Rockxy 的手动配置客户端将通过隧道传输，但不进行解密。

source: System-proxy clients matching these patterns connect directly and are not captured.
zh_hans: 匹配这些模式的系统代理客户端会直接连接，不会被捕获。

source: System-wide
zh_hans: 系统范围

source: Tab Width:
zh_hans: 标签页宽度：

source: TCP Connection
zh_hans: TCP 连接

source: Technical Documents…
zh_hans: 技术文档…

source: Template
zh_hans: 模板

source: Template Details
zh_hans: 模板详细信息

source: Template is missing.
zh_hans: 模板缺失。

source: Template kind
zh_hans: 模板类型

source: Template Kind
zh_hans: 模板类型

source: Template name
zh_hans: 模板名称

source: Templates…
zh_hans: 模板…

source: Terminal
zh_hans: 终端

source: Terminal app
zh_hans: 终端 App

source: Terminal session
zh_hans: 终端会话

source: Test
zh_hans: 测试

source: Test Connection
zh_hans: 测试连接

source: Test Map Local rule
zh_hans: 测试 Map Local 规则

source: Test Match
zh_hans: 测试匹配

source: Test method
zh_hans: 测试方法

source: Test request URL
zh_hans: 测试请求 URL

source: Test this rule
zh_hans: 测试此规则

source: Test URL
zh_hans: 测试 URL

source: Testing…
zh_hans: 正在测试…

source: Text
zh_hans: 文本

source: Text Selection: View as
zh_hans: 文本选择：查看为

source: That captured request is no longer available.
zh_hans: 该捕获请求已不可用。

source: The %@ segment is not valid JSON.
zh_hans: %@ 段不是有效的 JSON。

source: The active Block List rule limit was reached. Disable another rule and try again.
zh_hans: 已达到阻止列表规则的启用上限。请停用另一条规则后重试。

source: The active Breakpoint rule limit was reached. Disable another rule and try again.
zh_hans: 已达到断点规则的启用上限。请停用另一条规则后重试。

source: The active filter matches no requests
zh_hans: 当前筛选器没有匹配任何请求

source: The active Map Local rule limit was reached. Disable another rule and try again.
zh_hans: 已达到 Map Local 规则的启用上限。请停用另一条规则，然后重试。

source: The active Map Remote rule limit was reached. Disable another rule and try again.
zh_hans: 已达到 Map Remote 规则的启用上限。请停用另一条规则后重试。

source: The administrator authorization prompt was cancelled.
zh_hans: 管理员授权提示已取消。

source: The Allow List restricts capture to the hosts you specify, so Rockxy ignores everything else and the request list stays focused.
zh_hans: 允许列表将捕获限制为你指定的主机，因此 Rockxy 会忽略其他主机，使请求列表保持聚焦。

source: The app and helper have mismatched signing certificates.
zh_hans: App 和辅助工具的签名证书不匹配。

source: The app rejected Rockxy’s TLS handshake for this host. Certificate pinning is possible, but a custom trust policy can produce the same signal.
zh_hans: 应用拒绝了 Rockxy 针对此主机的 TLS 握手。应用可能启用了证书固定，但自定义信任策略也可能产生相同信号。

source: The authenticated identity may not have permission.
zh_hans: 已通过身份验证的身份可能没有权限。

source: The Babylon listener isn't running. Clients can't connect until it restarts.
zh_hans: Babylon 监听器未运行。在它重新启动前，客户端无法连接。

source: The Babylon listener isn't running. Open Pairing to review and retry.
zh_hans: Babylon 监听器未运行。请打开“配对”进行检查并重试。

source: The Babylon listener stopped unexpectedly.
zh_hans: Babylon 监听器意外停止。

source: The Block List returns 403 or drops the connection for matching requests, so you can simulate an endpoint being unavailable.
zh_hans: 阻止列表会对匹配请求返回 403 或断开连接，让你可以模拟端点不可用的情况。

source: The body is protected. Request-line, status, and header changes can still be applied.
zh_hans: 正文受保护。仍可应用请求行、状态和标头更改。

source: The Breakpoint Queue lets you inspect, edit, continue, or abort traffic after this rule pauses it.
zh_hans: 断点队列让你可以在此规则暂停流量后检查、编辑、继续或中止流量。

source: The captured requests are no longer available for review.
zh_hans: 捕获的请求已不再可供审查。

source: The captured response exceeded the configured buffer limit.
zh_hans: 捕获的响应超过了配置的缓冲区限制。

source: The captured response was HTTP %lld, so Rockxy shows a completed request.
zh_hans: 捕获的响应为 HTTP %lld，因此 Rockxy 显示已完成的请求。

source: The captured response was HTTP %lld.
zh_hans: 捕获的响应为 HTTP %lld。

source: The certificate and private key do not belong to the same identity.
zh_hans: 证书和私钥不属于同一身份。

source: The certificate could not be converted for preview.
zh_hans: 无法转换证书以供预览。

source: The certificate is in the keychain but trust settings are missing.
zh_hans: 证书已在钥匙串中，但缺少信任设置。

source: The certificate was not changed.
zh_hans: 证书未更改。

source: The configured model ‘%@’ was not found.
zh_hans: 找不到配置的模型 ‘%@’。

source: The configured provider endpoint is invalid.
zh_hans: 配置的提供商端点无效。

source: The configured provider is processing the reviewed request context.
zh_hans: 已配置的提供商正在处理已审查的请求上下文。

source: The CONNECT exchange establishes a tunnel; application HTTPS payloads belong to traffic inside that tunnel.
zh_hans: CONNECT 交互会建立隧道；应用程序 HTTPS 有效载荷属于该隧道内的流量。

source: The credential value remains hidden.
zh_hans: 凭据值仍处于隐藏状态。

source: The cURL command does not contain a URL.
zh_hans: 该 cURL 命令不包含 URL。

source: The current captured response is unchanged
zh_hans: 当前捕获的响应未更改

source: The current session is empty. Importing loads %@.
zh_hans: 当前会话为空。导入将加载 %@。

# The current session is empty. Opening loads %@ and %@.
source: The current session is empty. Opening loads %1$@ and %2$@.
zh_hans: 当前会话为空。打开后将加载 %1$@ 和 %2$@。

source: The destination protocol, host, and port still choose the remote server. Path and query overrides are ignored while this is enabled.
zh_hans: 目标协议、主机和端口仍用于选择远程服务器。启用此选项时，路径和查询覆盖项将被忽略。

source: The developer signature and Gatekeeper approval are checked before installation.
zh_hans: 安装前会检查开发者签名和 Gatekeeper 批准状态。

source: The downloaded application does not match the expected runtime identity.
zh_hans: 下载的应用程序与预期的运行时身份不匹配。

source: The downloaded application was not signed by the expected developer.
zh_hans: 下载的应用程序未由预期的开发者签名。

source: The downloaded runtime archive failed Rockxy's structure and size checks.
zh_hans: 下载的运行时归档未通过 Rockxy 的结构和大小检查。

source: The fetch snippet confirms that a predictable React Native request can reach Rockxy after the platform proxy and trust path is ready.
zh_hans: fetch 代码片段可确认，在平台代理和信任路径准备就绪后，可预测的 React Native 请求能够到达 Rockxy。
